; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v5)
             (pred_12 ?v1 ?v2)
             (pred_8 ?v10 ?v2)
             (pred_9 ?v13 ?v10 )
	     (pred_1 ?v10)
             (pred_6 ?v6)
             (pred_10 ?v1)
             (pred_11 ?v2)
             (pred_2 ?v10)
             (pred_3 ?v1)
             (pred_5 ?v10)
             (pred_4 ))



(:action op_2
:parameters (?v8 ?v4 ?v11 ?v3)
:precondition (and (pred_6 ?v8) (pred_6 ?v4) (pred_10 ?v11) (pred_11 ?v3)
          (pred_7 ?v8 ?v4) (pred_12 ?v11 ?v3)
                   (pred_8 ?v4 ?v3) (pred_1 ?v8) 
                   (pred_2 ?v4) (pred_3 ?v11))
:effect (and  (pred_5 ?v4) (not (pred_2 ?v4))))


(:action op_4
:parameters (?v8 ?v9)
:precondition (and (pred_6 ?v8) (pred_6 ?v9)
               (pred_1 ?v8) (pred_7 ?v8 ?v9) (pred_5 ?v9))
:effect (and (pred_1 ?v9) (not (pred_1 ?v8))))

(:action op_1
:parameters (?v8 ?v11)
:precondition (and (pred_6 ?v8) (pred_10 ?v11) 
                  (pred_1 ?v8) (pred_9 ?v11 ?v8) (pred_4 ))
:effect (and (pred_3 ?v11)
   (not (pred_9 ?v11 ?v8)) (not (pred_4 ))))


(:action op_3
:parameters (?v8 ?v12 ?v7)
:precondition (and (pred_6 ?v8) (pred_10 ?v12) (pred_10 ?v7)
                  (pred_1 ?v8) (pred_3 ?v7) (pred_9 ?v12 ?v8))
:effect (and (pred_3 ?v12) (pred_9 ?v7 ?v8)
        (not (pred_3 ?v7)) (not (pred_9 ?v12 ?v8))))

(:action op_5
:parameters (?v8 ?v11)
:precondition (and (pred_6 ?v8) (pred_10 ?v11) 
                  (pred_1 ?v8) (pred_3 ?v11))
:effect (and (pred_4 ) (pred_9 ?v11 ?v8) (not (pred_3 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_19 obj_29 obj_05 obj_15 obj_13 obj_01 obj_28 obj_12 obj_11 obj_20 obj_02 obj_30 obj_23 obj_14 obj_07 obj_17 obj_26 obj_10 obj_24 obj_27 obj_08 obj_03 obj_06 obj_18
    obj_09 obj_22
    obj_16 obj_04 obj_25
    )

    (:init
       (pred_4)

       (pred_6 obj_21)
       (pred_6 obj_19)
       (pred_6 obj_29)
       (pred_6 obj_05)
       (pred_6 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_01)
       (pred_6 obj_28)
       (pred_6 obj_12)
       (pred_6 obj_11)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_30)
       (pred_6 obj_23)
       (pred_6 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_17)
       (pred_6 obj_26)
       (pred_6 obj_10)
       (pred_6 obj_24)
       (pred_6 obj_27)
       (pred_6 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_18)
       (pred_11 obj_09)
       (pred_11 obj_22)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_25)

       (pred_7 obj_21 obj_13)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_29)
       (pred_7 obj_19 obj_21)
       (pred_7 obj_29 obj_28)
       (pred_7 obj_29 obj_05)
       (pred_7 obj_29 obj_19)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_29)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_01 obj_28)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_28 obj_30)
       (pred_7 obj_28 obj_12)
       (pred_7 obj_28 obj_29)
       (pred_7 obj_28 obj_01)
       (pred_7 obj_12 obj_23)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_12 obj_28)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_20 obj_07)
       (pred_7 obj_20 obj_02)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_02 obj_17)
       (pred_7 obj_02 obj_30)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_20)
       (pred_7 obj_30 obj_26)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_30 obj_28)
       (pred_7 obj_30 obj_02)
       (pred_7 obj_23 obj_10)
       (pred_7 obj_23 obj_14)
       (pred_7 obj_23 obj_12)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_14 obj_24)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_23)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_20)
       (pred_7 obj_17 obj_08)
       (pred_7 obj_17 obj_26)
       (pred_7 obj_17 obj_02)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_26 obj_03)
       (pred_7 obj_26 obj_10)
       (pred_7 obj_26 obj_30)
       (pred_7 obj_26 obj_17)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_10 obj_24)
       (pred_7 obj_10 obj_23)
       (pred_7 obj_10 obj_26)
       (pred_7 obj_24 obj_18)
       (pred_7 obj_24 obj_14)
       (pred_7 obj_24 obj_10)
       (pred_7 obj_27 obj_08)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_08 obj_17)
       (pred_7 obj_08 obj_27)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_26)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_06 obj_18)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_18 obj_24)
       (pred_7 obj_18 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_08)
       (pred_2 obj_06)
       (pred_8  obj_12 obj_09)
       (pred_8  obj_08 obj_22)
       (pred_8  obj_06 obj_09)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_29)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_13)
       (pred_5 obj_01)
       (pred_5 obj_28)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_30)
       (pred_5 obj_23)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_26)
       (pred_5 obj_10)
       (pred_5 obj_24)
       (pred_5 obj_27)
       (pred_5 obj_03)
       (pred_5 obj_18)

       (pred_12  obj_16 obj_09)
       (pred_12  obj_04 obj_22)
       (pred_12  obj_25 obj_09)
       (pred_9 obj_16 obj_27)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_25 obj_21)
       (pred_1 obj_15)
    )

    (:goal (and
       (pred_9 obj_16 obj_13)
       (pred_9 obj_04 obj_21)
       (pred_9 obj_25 obj_29)
    ))
(:constraints
  (always (not (pred_1 obj_20)))
)
)

; plan
1. (op_4 obj_15 obj_05)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_05)
   goals met: 0 of 3
2. (op_4 obj_05 obj_29)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_29)
   goals met: 0 of 3
3. (op_4 obj_29 obj_19)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_19)
   goals met: 0 of 3
4. (op_4 obj_19 obj_01)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_01)
   goals met: 0 of 3
5. (op_1 obj_01 obj_04)
   deleted: (pred_9 obj_04 obj_01) (pred_4)
   added: (pred_3 obj_04)
   goals met: 0 of 3
6. (op_4 obj_01 obj_13)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_13)
   goals met: 0 of 3
7. (op_4 obj_13 obj_21)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_21)
   goals met: 0 of 3
8. (op_3 obj_21 obj_25 obj_04)
   deleted: (pred_3 obj_04) (pred_9 obj_25 obj_21)
   added: (pred_3 obj_25) (pred_9 obj_04 obj_21)
   goals met: 1 of 3
9. (op_4 obj_21 obj_19)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_19)
   goals met: 1 of 3
10. (op_4 obj_19 obj_29)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_29)
   goals met: 1 of 3
11. (op_5 obj_29 obj_25)
   deleted: (pred_3 obj_25)
   added: (pred_4) (pred_9 obj_25 obj_29)
   goals met: 2 of 3
12. (op_4 obj_29 obj_19)
   deleted: (pred_1 obj_29)
   added: (pred_1 obj_19)
   goals met: 2 of 3
13. (op_4 obj_19 obj_01)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_01)
   goals met: 2 of 3
14. (op_4 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 2 of 3
15. (op_4 obj_02 obj_17)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_17)
   goals met: 2 of 3
16. (op_4 obj_17 obj_07)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_07)
   goals met: 2 of 3
17. (op_4 obj_07 obj_27)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_27)
   goals met: 2 of 3
18. (op_1 obj_27 obj_16)
   deleted: (pred_9 obj_16 obj_27) (pred_4)
   added: (pred_3 obj_16)
   goals met: 2 of 3
19. (op_4 obj_27 obj_07)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_07)
   goals met: 2 of 3
20. (op_4 obj_07 obj_17)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_17)
   goals met: 2 of 3
21. (op_4 obj_17 obj_02)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_02)
   goals met: 2 of 3
22. (op_4 obj_02 obj_01)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_01)
   goals met: 2 of 3
23. (op_4 obj_01 obj_13)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_13)
   goals met: 2 of 3
24. (op_5 obj_13 obj_16)
   deleted: (pred_3 obj_16)
   added: (pred_4) (pred_9 obj_16 obj_13)
   goals met: 3 of 3
